RomanTheLegend/FlySight-vscode/STM32_WPAN/App/custom_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    App/custom_app.c
  * @author  MCD Application Team
  * @brief   Custom Example Application (Server)
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "dbg_trace.h"
#include "ble.h"
#include "custom_app.h"
#include "custom_stm.h"
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "crs.h"
#include "start_control.h"
#include "gnss_ble.h"
#include "mode.h"
#include "ble_tx_queue.h"
#include "sensor_data.h"
#include "device_state.h"
#include "control_point_protocol.h"
#include "vbat.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  /* File_Transfer */
  uint8_t               Ft_packet_out_Notification_Status;
  /* Sensor_Data */
  uint8_t               Sd_gnss_measurement_Notification_Status;
  uint8_t               Sd_control_point_Indication_Status;
  /* Starter_Pistol */
  uint8_t               Sp_control_point_Indication_Status;
  uint8_t               Sp_result_Indication_Status;
  /* Device_State */
  uint8_t               Ds_mode_Indication_Status;
  uint8_t               Ds_control_point_Indication_Status;
  /* Battery */
  uint8_t               Battery_level_Notification_Status;
  /* USER CODE BEGIN CUSTOM_APP_Context_t */

  /* USER CODE END CUSTOM_APP_Context_t */

  uint16_t              ConnectionHandle;
} Custom_App_Context_t;

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
#define TIMEOUT_MSEC  30000
#define TIMEOUT_TICKS (TIMEOUT_MSEC*1000/CFG_TS_TICK_VAL)
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/**
 * START of Section BLE_APP_CONTEXT
 */

static Custom_App_Context_t Custom_App_Context;

/**
 * END of Section BLE_APP_CONTEXT
 */

uint8_t UpdateCharData[247];
uint8_t NotifyCharData[247];

/* USER CODE BEGIN PV */
static Custom_CRS_Packet_t rx_buffer[FS_CRS_WINDOW_LENGTH+1];
static uint32_t rx_read_index, rx_write_index;

static uint8_t gnss_pv_packet[GNSS_BLE_MAX_LEN];

static uint8_t start_result_packet[9];

static uint8_t connected_flag = 0;

extern uint8_t SizeSd_Gnss_Measurement;
extern uint8_t SizeSd_Control_Point;

static uint8_t timeout_timer_id;

static uint8_t current_battery_level_percent = 0;
static uint8_t ble_vbat_started = 0;
static uint8_t ble_adc_started = 0;

extern ADC_HandleTypeDef hadc1;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* File_Transfer */
static void Custom_Ft_packet_out_Update_Char(void);
static void Custom_Ft_packet_out_Send_Notification(void);
/* Sensor_Data */
static void Custom_Sd_gnss_measurement_Update_Char(void);
static void Custom_Sd_gnss_measurement_Send_Notification(void);
static void Custom_Sd_control_point_Update_Char(void);
static void Custom_Sd_control_point_Send_Indication(void);
/* Starter_Pistol */
static void Custom_Sp_control_point_Update_Char(void);
static void Custom_Sp_control_point_Send_Indication(void);
static void Custom_Sp_result_Update_Char(void);
static void Custom_Sp_result_Send_Indication(void);
/* Device_State */
static void Custom_Ds_mode_Update_Char(void);
static void Custom_Ds_mode_Send_Indication(void);
static void Custom_Ds_control_point_Update_Char(void);
static void Custom_Ds_control_point_Send_Indication(void);
/* Battery */
static void Custom_Battery_level_Update_Char(void);
static void Custom_Battery_level_Send_Notification(void);

/* USER CODE BEGIN PFP */
static void Custom_CRS_OnConnect(Custom_App_ConnHandle_Not_evt_t *pNotification);
static void Custom_CRS_OnDisconnect(void);
static void Custom_CRS_OnRxWrite(Custom_STM_App_Notification_evt_t *pNotification);
static void Custom_App_Timeout(void);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void Custom_STM_App_Notification(Custom_STM_App_Notification_evt_t *pNotification)
{
  /* USER CODE BEGIN CUSTOM_STM_App_Notification_1 */

  /* USER CODE END CUSTOM_STM_App_Notification_1 */
  switch (pNotification->Custom_Evt_Opcode)
  {
    /* USER CODE BEGIN CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

    /* USER CODE END CUSTOM_STM_App_Notification_Custom_Evt_Opcode */

    /* File_Transfer */
    case CUSTOM_STM_FT_PACKET_OUT_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_FT_PACKET_OUT_NOTIFY_ENABLED_EVT */
      Custom_App_Context.Ft_packet_out_Notification_Status = 1;
      /* USER CODE END CUSTOM_STM_FT_PACKET_OUT_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_FT_PACKET_OUT_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_FT_PACKET_OUT_NOTIFY_DISABLED_EVT */
      Custom_App_Context.Ft_packet_out_Notification_Status = 0;
      /* USER CODE END CUSTOM_STM_FT_PACKET_OUT_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_FT_PACKET_IN_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_FT_PACKET_IN_READ_EVT */

      /* USER CODE END CUSTOM_STM_FT_PACKET_IN_READ_EVT */
      break;

    case CUSTOM_STM_FT_PACKET_IN_WRITE_NO_RESP_EVT:
      /* USER CODE BEGIN CUSTOM_STM_FT_PACKET_IN_WRITE_NO_RESP_EVT */
      Custom_CRS_OnRxWrite(pNotification);
      /* USER CODE END CUSTOM_STM_FT_PACKET_IN_WRITE_NO_RESP_EVT */
      break;

    /* Sensor_Data */
    case CUSTOM_STM_SD_GNSS_MEASUREMENT_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SD_GNSS_MEASUREMENT_READ_EVT */
      if (!Custom_App_Context.Sd_gnss_measurement_Notification_Status)
      {
        Custom_STM_App_Update_Char(CUSTOM_STM_SD_GNSS_MEASUREMENT, gnss_pv_packet);
      }
      /* USER CODE END CUSTOM_STM_SD_GNSS_MEASUREMENT_READ_EVT */
      break;

