RomanTheLegend/FlySight-vscode/STM32_WPAN/App/custom_app.c
    case CUSTOM_STM_SD_GNSS_MEASUREMENT_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SD_GNSS_MEASUREMENT_NOTIFY_ENABLED_EVT */
      Custom_App_Context.Sd_gnss_measurement_Notification_Status = 1;
      /* USER CODE END CUSTOM_STM_SD_GNSS_MEASUREMENT_NOTIFY_ENABLED_EVT */
      break;

    case CUSTOM_STM_SD_GNSS_MEASUREMENT_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SD_GNSS_MEASUREMENT_NOTIFY_DISABLED_EVT */
      Custom_App_Context.Sd_gnss_measurement_Notification_Status = 0;
      /* USER CODE END CUSTOM_STM_SD_GNSS_MEASUREMENT_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_SD_CONTROL_POINT_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SD_CONTROL_POINT_WRITE_EVT */
      SensorData_Handle_SD_ControlPointWrite(
          pNotification->DataTransfered.pPayload,
          pNotification->DataTransfered.Length,
          pNotification->ConnectionHandle,
          Custom_App_Context.Sd_control_point_Indication_Status);
      /* USER CODE END CUSTOM_STM_SD_CONTROL_POINT_WRITE_EVT */
      break;

    case CUSTOM_STM_SD_CONTROL_POINT_INDICATE_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SD_CONTROL_POINT_INDICATE_ENABLED_EVT */
      Custom_App_Context.Sd_control_point_Indication_Status = 1;
      /* USER CODE END CUSTOM_STM_SD_CONTROL_POINT_INDICATE_ENABLED_EVT */
      break;

    case CUSTOM_STM_SD_CONTROL_POINT_INDICATE_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SD_CONTROL_POINT_INDICATE_DISABLED_EVT */
      Custom_App_Context.Sd_control_point_Indication_Status = 0;
      /* USER CODE END CUSTOM_STM_SD_CONTROL_POINT_INDICATE_DISABLED_EVT */
      break;

    /* Starter_Pistol */
    case CUSTOM_STM_SP_CONTROL_POINT_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SP_CONTROL_POINT_WRITE_EVT */
      FS_StartControl_Handle_SP_ControlPointWrite(
          pNotification->DataTransfered.pPayload,
          pNotification->DataTransfered.Length,
          pNotification->ConnectionHandle,
          Custom_App_Context.Sp_control_point_Indication_Status);
      /* USER CODE END CUSTOM_STM_SP_CONTROL_POINT_WRITE_EVT */
      break;

    case CUSTOM_STM_SP_CONTROL_POINT_INDICATE_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SP_CONTROL_POINT_INDICATE_ENABLED_EVT */
      Custom_App_Context.Sp_control_point_Indication_Status = 1;
      /* USER CODE END CUSTOM_STM_SP_CONTROL_POINT_INDICATE_ENABLED_EVT */
      break;

    case CUSTOM_STM_SP_CONTROL_POINT_INDICATE_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SP_CONTROL_POINT_INDICATE_DISABLED_EVT */
      Custom_App_Context.Sp_control_point_Indication_Status = 0;
      /* USER CODE END CUSTOM_STM_SP_CONTROL_POINT_INDICATE_DISABLED_EVT */
      break;

    case CUSTOM_STM_SP_RESULT_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SP_RESULT_READ_EVT */
      if (!Custom_App_Context.Sp_result_Indication_Status)
      {
        Custom_STM_App_Update_Char(CUSTOM_STM_SP_RESULT, start_result_packet);
      }
      /* USER CODE END CUSTOM_STM_SP_RESULT_READ_EVT */
      break;

    case CUSTOM_STM_SP_RESULT_INDICATE_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SP_RESULT_INDICATE_ENABLED_EVT */
      Custom_App_Context.Sp_result_Indication_Status = 1;
      /* USER CODE END CUSTOM_STM_SP_RESULT_INDICATE_ENABLED_EVT */
      break;

    case CUSTOM_STM_SP_RESULT_INDICATE_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_SP_RESULT_INDICATE_DISABLED_EVT */
      Custom_App_Context.Sp_result_Indication_Status = 0;
      /* USER CODE END CUSTOM_STM_SP_RESULT_INDICATE_DISABLED_EVT */
      break;

    /* Device_State */
    case CUSTOM_STM_DS_MODE_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DS_MODE_READ_EVT */
      uint8_t modeVal = (uint8_t) FS_Mode_State();  // Get current state from mode module
      Custom_STM_App_Update_Char(CUSTOM_STM_DS_MODE, &modeVal);
      /* USER CODE END CUSTOM_STM_DS_MODE_READ_EVT */
      break;

    case CUSTOM_STM_DS_MODE_INDICATE_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DS_MODE_INDICATE_ENABLED_EVT */
      Custom_App_Context.Ds_mode_Indication_Status = 1;
      /* USER CODE END CUSTOM_STM_DS_MODE_INDICATE_ENABLED_EVT */
      break;

    case CUSTOM_STM_DS_MODE_INDICATE_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DS_MODE_INDICATE_DISABLED_EVT */
      Custom_App_Context.Ds_mode_Indication_Status = 0;
      /* USER CODE END CUSTOM_STM_DS_MODE_INDICATE_DISABLED_EVT */
      break;

    case CUSTOM_STM_DS_CONTROL_POINT_WRITE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DS_CONTROL_POINT_WRITE_EVT */
      DeviceState_Handle_DS_ControlPointWrite(
          pNotification->DataTransfered.pPayload,
          pNotification->DataTransfered.Length,
          pNotification->ConnectionHandle,
          Custom_App_Context.Ds_control_point_Indication_Status);
      /* USER CODE END CUSTOM_STM_DS_CONTROL_POINT_WRITE_EVT */
      break;

    case CUSTOM_STM_DS_CONTROL_POINT_INDICATE_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DS_CONTROL_POINT_INDICATE_ENABLED_EVT */
      Custom_App_Context.Ds_control_point_Indication_Status = 1;
      /* USER CODE END CUSTOM_STM_DS_CONTROL_POINT_INDICATE_ENABLED_EVT */
      break;

    case CUSTOM_STM_DS_CONTROL_POINT_INDICATE_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_DS_CONTROL_POINT_INDICATE_DISABLED_EVT */
      Custom_App_Context.Ds_control_point_Indication_Status = 0;
      /* USER CODE END CUSTOM_STM_DS_CONTROL_POINT_INDICATE_DISABLED_EVT */
      break;

    /* Battery */
    case CUSTOM_STM_BATTERY_LEVEL_READ_EVT:
      /* USER CODE BEGIN CUSTOM_STM_BATTERY_LEVEL_READ_EVT */
      APP_DBG_MSG("CUSTOM_STM_BATTERY_LEVEL_READ_EVT received\n");
      // The actual calculation and update should happen when FS_VBAT_ValueReady_Callback runs,
      // or we need a way to trigger FS_VBAT_ValueReady_Callback or get the latest value here.
      // For simplicity, let's assume current_battery_level_percent is up-to-date.
      Custom_STM_App_Update_Char(CUSTOM_STM_BATTERY_LEVEL, &current_battery_level_percent);
      /* USER CODE END CUSTOM_STM_BATTERY_LEVEL_READ_EVT */
      break;

    case CUSTOM_STM_BATTERY_LEVEL_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_BATTERY_LEVEL_NOTIFY_ENABLED_EVT */
      APP_DBG_MSG("CUSTOM_STM_BATTERY_LEVEL_NOTIFY_ENABLED_EVT received\n");
      Custom_App_Context.Battery_level_Notification_Status = 1;
      // Optionally, send the current level immediately upon enabling notifications
      Custom_STM_App_Update_Char(CUSTOM_STM_BATTERY_LEVEL, &current_battery_level_percent);
      /* USER CODE END CUSTOM_STM_BATTERY_LEVEL_NOTIFY_ENABLED_EVT */
      break;

