RomanTheLegend/FlySight-vscode/STM32_WPAN/App/custom_app.c
    case CUSTOM_STM_BATTERY_LEVEL_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN CUSTOM_STM_BATTERY_LEVEL_NOTIFY_DISABLED_EVT */
      APP_DBG_MSG("CUSTOM_STM_BATTERY_LEVEL_NOTIFY_DISABLED_EVT received\n");
      Custom_App_Context.Battery_level_Notification_Status = 0;
      /* USER CODE END CUSTOM_STM_BATTERY_LEVEL_NOTIFY_DISABLED_EVT */
      break;

    case CUSTOM_STM_NOTIFICATION_COMPLETE_EVT:
      /* USER CODE BEGIN CUSTOM_STM_NOTIFICATION_COMPLETE_EVT */
      DeviceState_Handle_DS_ControlPointNotificationComplete(pNotification->AttrHandle);
      /* USER CODE END CUSTOM_STM_NOTIFICATION_COMPLETE_EVT */
      break;

    default:
      /* USER CODE BEGIN CUSTOM_STM_App_Notification_default */

      /* USER CODE END CUSTOM_STM_App_Notification_default */
      break;
  }
  /* USER CODE BEGIN CUSTOM_STM_App_Notification_2 */

  /* USER CODE END CUSTOM_STM_App_Notification_2 */
  return;
}

void Custom_APP_Notification(Custom_App_ConnHandle_Not_evt_t *pNotification)
{
  /* USER CODE BEGIN CUSTOM_APP_Notification_1 */

  /* USER CODE END CUSTOM_APP_Notification_1 */

  switch (pNotification->Custom_Evt_Opcode)
  {
    /* USER CODE BEGIN CUSTOM_APP_Notification_Custom_Evt_Opcode */

    /* USER CODE END P2PS_CUSTOM_Notification_Custom_Evt_Opcode */
    case CUSTOM_CONN_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_CONN_HANDLE_EVT */
      Custom_CRS_OnConnect(pNotification);
      /* USER CODE END CUSTOM_CONN_HANDLE_EVT */
      break;

    case CUSTOM_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN CUSTOM_DISCON_HANDLE_EVT */
      Custom_CRS_OnDisconnect();
      /* USER CODE END CUSTOM_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN CUSTOM_APP_Notification_default */

      /* USER CODE END CUSTOM_APP_Notification_default */
      break;
  }

  /* USER CODE BEGIN CUSTOM_APP_Notification_2 */

  /* USER CODE END CUSTOM_APP_Notification_2 */

  return;
}

void Custom_APP_Init(void)
{
  /* USER CODE BEGIN CUSTOM_APP_Init */
  BLE_TX_Queue_Init();

  SensorData_Init();
  DeviceState_Init();
  // Starter Pistol is initialized by the main mode logic when entering that mode.

  /* File_Transfer */
  Custom_App_Context.Ft_packet_out_Notification_Status = 0;

  /* Sensor_Data */
  Custom_App_Context.Sd_gnss_measurement_Notification_Status = 0;
  Custom_App_Context.Sd_control_point_Indication_Status = 0;

  /* Starter_Pistol */
  Custom_App_Context.Sp_control_point_Indication_Status = 0;
  Custom_App_Context.Sp_result_Indication_Status = 0;

  /* Device_State */
  Custom_App_Context.Ds_mode_Indication_Status = 0;
  Custom_App_Context.Ds_control_point_Indication_Status = 0;

  /* Battery Service */
  Custom_App_Context.Battery_level_Notification_Status = 0;
  current_battery_level_percent = 0;

  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &timeout_timer_id, hw_ts_SingleShot, Custom_App_Timeout);
  /* USER CODE END CUSTOM_APP_Init */
  return;
}

/* USER CODE BEGIN FD */
void Custom_APP_TxPoolAvailableNotification(void)
{
  BLE_TX_Queue_TxPoolAvailableNotification();
}

uint8_t Custom_APP_IsConnected(void)
{
  return connected_flag;
}
/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/* File_Transfer */
void Custom_Ft_packet_out_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Ft_packet_out_UC_1*/

  /* USER CODE END Ft_packet_out_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_FT_PACKET_OUT, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Ft_packet_out_UC_Last*/

  /* USER CODE END Ft_packet_out_UC_Last*/
  return;
}

void Custom_Ft_packet_out_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Ft_packet_out_NS_1*/

  /* USER CODE END Ft_packet_out_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_FT_PACKET_OUT, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Ft_packet_out_NS_Last*/

  /* USER CODE END Ft_packet_out_NS_Last*/

  return;
}

/* Sensor_Data */
void Custom_Sd_gnss_measurement_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Sd_gnss_measurement_UC_1*/

  /* USER CODE END Sd_gnss_measurement_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_SD_GNSS_MEASUREMENT, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Sd_gnss_measurement_UC_Last*/

  /* USER CODE END Sd_gnss_measurement_UC_Last*/
  return;
}

void Custom_Sd_gnss_measurement_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Sd_gnss_measurement_NS_1*/

  /* USER CODE END Sd_gnss_measurement_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_SD_GNSS_MEASUREMENT, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Sd_gnss_measurement_NS_Last*/

  /* USER CODE END Sd_gnss_measurement_NS_Last*/

  return;
}

void Custom_Sd_control_point_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Sd_control_point_UC_1*/

  /* USER CODE END Sd_control_point_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_SD_CONTROL_POINT, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Sd_control_point_UC_Last*/

  /* USER CODE END Sd_control_point_UC_Last*/
  return;
}

void Custom_Sd_control_point_Send_Indication(void) /* Property Indication */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Sd_control_point_IS_1*/

  /* USER CODE END Sd_control_point_IS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_SD_CONTROL_POINT, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Sd_control_point_IS_Last*/

  /* USER CODE END Sd_control_point_IS_Last*/

  return;
}

/* Starter_Pistol */
void Custom_Sp_control_point_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Sp_control_point_UC_1*/

  /* USER CODE END Sp_control_point_UC_1*/

