RomanTheLegend/FlySight-vscode/STM32_WPAN/App/custom_app.c
  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_SP_CONTROL_POINT, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Sp_control_point_UC_Last*/

  /* USER CODE END Sp_control_point_UC_Last*/
  return;
}

void Custom_Sp_control_point_Send_Indication(void) /* Property Indication */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Sp_control_point_IS_1*/

  /* USER CODE END Sp_control_point_IS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_SP_CONTROL_POINT, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Sp_control_point_IS_Last*/

  /* USER CODE END Sp_control_point_IS_Last*/

  return;
}

void Custom_Sp_result_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Sp_result_UC_1*/

  /* USER CODE END Sp_result_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_SP_RESULT, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Sp_result_UC_Last*/

  /* USER CODE END Sp_result_UC_Last*/
  return;
}

void Custom_Sp_result_Send_Indication(void) /* Property Indication */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Sp_result_IS_1*/

  /* USER CODE END Sp_result_IS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_SP_RESULT, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Sp_result_IS_Last*/

  /* USER CODE END Sp_result_IS_Last*/

  return;
}

/* Device_State */
void Custom_Ds_mode_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Ds_mode_UC_1*/

  /* USER CODE END Ds_mode_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DS_MODE, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Ds_mode_UC_Last*/

  /* USER CODE END Ds_mode_UC_Last*/
  return;
}

void Custom_Ds_mode_Send_Indication(void) /* Property Indication */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Ds_mode_IS_1*/

  /* USER CODE END Ds_mode_IS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DS_MODE, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Ds_mode_IS_Last*/

  /* USER CODE END Ds_mode_IS_Last*/

  return;
}

void Custom_Ds_control_point_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Ds_control_point_UC_1*/

  /* USER CODE END Ds_control_point_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DS_CONTROL_POINT, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Ds_control_point_UC_Last*/

  /* USER CODE END Ds_control_point_UC_Last*/
  return;
}

void Custom_Ds_control_point_Send_Indication(void) /* Property Indication */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Ds_control_point_IS_1*/

  /* USER CODE END Ds_control_point_IS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_DS_CONTROL_POINT, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Ds_control_point_IS_Last*/

  /* USER CODE END Ds_control_point_IS_Last*/

  return;
}

/* Battery */
void Custom_Battery_level_Update_Char(void) /* Property Read */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Battery_level_UC_1*/

  /* USER CODE END Battery_level_UC_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_BATTERY_LEVEL, (uint8_t *)UpdateCharData);
  }

  /* USER CODE BEGIN Battery_level_UC_Last*/

  /* USER CODE END Battery_level_UC_Last*/
  return;
}

void Custom_Battery_level_Send_Notification(void) /* Property Notification */
{
  uint8_t updateflag = 0;

  /* USER CODE BEGIN Battery_level_NS_1*/

  /* USER CODE END Battery_level_NS_1*/

  if (updateflag != 0)
  {
    Custom_STM_App_Update_Char(CUSTOM_STM_BATTERY_LEVEL, (uint8_t *)NotifyCharData);
  }

  /* USER CODE BEGIN Battery_level_NS_Last*/

  /* USER CODE END Battery_level_NS_Last*/

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/
static void Custom_CRS_OnConnect(Custom_App_ConnHandle_Not_evt_t *pNotification)
{
  // Reset buffer indices
  rx_read_index = 0;
  rx_write_index = 0;

  // Update state
  connected_flag = 1;

  // Remember connection handle
  Custom_App_Context.ConnectionHandle = pNotification->ConnectionHandle;

  // Start VBAT measurement for battery level reporting when not in active mode
  // (active mode manages VBAT independently via FS_ActiveMode_Init)
  if (FS_Mode_State() != FS_MODE_STATE_ACTIVE)
  {
    if (HAL_ADC_GetState(&hadc1) == HAL_ADC_STATE_RESET)
    {
      MX_ADC1_Init();
      HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED);
      ble_adc_started = 1;
    }
    FS_VBAT_Init();
    ble_vbat_started = 1;
  }

  // Start timeout timer
  APP_DBG_MSG("Start connection timeout\n");
  HW_TS_Start(timeout_timer_id, TIMEOUT_TICKS);
}

static void Custom_CRS_OnDisconnect(void)
{
  // Stop timeout timer
  APP_DBG_MSG("Stop connection timeout\n");
  HW_TS_Stop(timeout_timer_id);

  // Stop VBAT measurement if BLE started it
  if (ble_vbat_started)
  {
    FS_VBAT_DeInit();
    ble_vbat_started = 0;
  }
  if (ble_adc_started)
  {
    HAL_ADC_DeInit(&hadc1);
    ble_adc_started = 0;
  }

  // Update state
  connected_flag = 0;

  // Reset per-connection CCCD mirrors so producers stop sending
  Custom_App_Context.Ft_packet_out_Notification_Status = 0;

  Custom_App_Context.Sd_gnss_measurement_Notification_Status = 0;
  Custom_App_Context.Sd_control_point_Indication_Status = 0;

  Custom_App_Context.Sp_control_point_Indication_Status = 0;
  Custom_App_Context.Sp_result_Indication_Status = 0;

  Custom_App_Context.Ds_mode_Indication_Status = 0;
  Custom_App_Context.Ds_control_point_Indication_Status = 0;

  Custom_App_Context.Battery_level_Notification_Status = 0;

  // Call update task
  UTIL_SEQ_SetTask(1<<CFG_TASK_FS_CRS_UPDATE_ID, CFG_SCH_PRIO_1);
}

static void Custom_CRS_OnRxWrite(Custom_STM_App_Notification_evt_t *pNotification)
{
  Custom_CRS_Packet_t *packet;

  if (rx_write_index < rx_read_index + FS_CRS_WINDOW_LENGTH)
  {
    APP_DBG_MSG("Received data on CRS_RX\n");

    packet = &rx_buffer[(rx_write_index++) % FS_CRS_WINDOW_LENGTH];
	packet->length = pNotification->DataTransfered.Length;
    memcpy(packet->data, pNotification->DataTransfered.pPayload, packet->length);

	// Call update task
	UTIL_SEQ_SetTask(1<<CFG_TASK_FS_CRS_UPDATE_ID, CFG_SCH_PRIO_1);
  }
  else
  {
    APP_DBG_MSG("Custom_CRS_OnRxWrite: buffer overflow\n");
  }

  // Refresh timeout timer
  HW_TS_Start(timeout_timer_id, TIMEOUT_TICKS);
}

Custom_CRS_Packet_t *Custom_CRS_GetNextRxPacket(void)
{
  Custom_CRS_Packet_t *ret = 0;

  if (rx_read_index < rx_write_index)
  {
	ret = &rx_buffer[(rx_read_index++) % FS_CRS_WINDOW_LENGTH];
  }

  return ret;
}

void Custom_GNSS_Update(const FS_GNSS_Data_t *current)
{
  uint8_t length = GNSS_BLE_Build(current, gnss_pv_packet);

